src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьТипНоменклатурыПоРодителю();
	КонецЕсли;
	 
	 УстановитьСписокВыбораСчетаБухгалтерскогоУчета(); 
	
КонецПроцедуры

 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьИДоступностьЭлементов();
		
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
	Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
	
	УстановитьСписокВыбораСчетаБухгалтерскогоУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	ЗаполнитьТипНоменклатурыПоРодителю();
	
	Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
	
	УстановитьСписокВыбораСчетаБухгалтерскогоУчета();
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТипНоменклатурыПоРодителю()
	
	Если ЗначениеЗаполнено(Объект.Родитель.ТипНоменклатуры) Тогда
		Объект.ТипНоменклатуры = Объект.Родитель.ТипНоменклатуры;
	Иначе
		Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимостьИДоступностьЭлементов()

	Элементы.ДлительностьУслуги.Видимость = (Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	Элементы.СчетБухгалтерскогоУчета.Доступность = Не (Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МатериалКлиента"));

КонецПроцедуры

&НаСервере 
Процедура УстановитьСписокВыбораСчетаБухгалтерскогоУчета()
	
	МассивЗначений = Новый Массив;
	
	Если Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
		
		МассивЗначений.Добавить(ПланыСчетов.Хозрасчетный.Товары);
		
	ИначеЕсли Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда
		
		МассивЗначений.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
		
	ИначеЕсли Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		
		МассивЗначений.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаПродажу);
		МассивЗначений.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
		
	КонецЕсли;
	
	Элементы.СчетБухгалтерскогоУчета.СписокВыбора.ЗагрузитьЗначения(МассивЗначений);

КонецПроцедуры
